---
type: StructuralSectionGeneralC
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 2
tags: [revit-api, class]
---

# StructuralSectionGeneralC

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralC` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionGeneralC | 2018 | `public StructuralSectionGeneralC ( double width , double height , double wallNominalThickness , double wallDesignThickness , double innerFillet , double lipLength , double centroidHorizontal , double centroidVertical , S` |
| Property | LipLength | 2018 | `public double LipLength { get ; set ; }` |